Revit 2024 API
BuiltInFailures.DesignOptionFailures.ElementsWillBeDeletedNoOption Property
 Elements will be deleted
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementsWillBeDeletedNoOption { get; }
Visual Basic
Public Shared ReadOnly Property ElementsWillBeDeletedNoOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementsWillBeDeletedNoOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace